In [3]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings(action='ignore')

In [4]:
list1=[10,20,30,40,50,60]
labels=['Ahmedabad','bangalore','c','d','e','f']

In [5]:
pd.Series([10,20,30,40,50.67,60+7j],index=['Ahmedabad','bangalore','calcutta','delhi','england','finland'])

Ahmedabad    10.000000+0.000000j
bangalore    20.000000+0.000000j
calcutta     30.000000+0.000000j
delhi        40.000000+0.000000j
england      50.670000+0.000000j
finland      60.000000+7.000000j
dtype: complex128

In [6]:
d={100:2,300:4,500:6}
pd.Series(d)

100    2
300    4
500    6
dtype: int64

In [7]:
pd.Series({0.556556,12,787})

TypeError: 'set' type is unordered

In [8]:
pd.Series(True)

0    True
dtype: bool

In [9]:
data=pd.Series([10,20,30,40,50,60],index=['Ahmedabad','bangalore','calcutta','delhi','england','finland'])

In [10]:
data

Ahmedabad    10
bangalore    20
calcutta     30
delhi        40
england      50
finland      60
dtype: int64

In [11]:
data>50

Ahmedabad    False
bangalore    False
calcutta     False
delhi        False
england      False
finland       True
dtype: bool

In [12]:
data[data>50]

finland    60
dtype: int64

In [13]:
data

Ahmedabad    10
bangalore    20
calcutta     30
delhi        40
england      50
finland      60
dtype: int64

In [14]:
data.dtype

dtype('int64')

In [15]:
data.ndim

1

In [16]:
data.shape

(6,)

In [17]:
type(data)

pandas.core.series.Series

In [18]:
id(data)

2213278184064

In [19]:
data

Ahmedabad    10
bangalore    20
calcutta     30
delhi        40
england      50
finland      60
dtype: int64

In [20]:
data.loc['finland']# reading method

60

In [21]:
data.iloc[0]

10

In [22]:
data['calcutta']# full extraction of data

30

In [23]:
data['calcutta']=100

In [24]:
data

Ahmedabad     10
bangalore     20
calcutta     100
delhi         40
england       50
finland       60
dtype: int64

In [25]:
list(enumerate(data,start=11))

[(11, 10), (12, 20), (13, 100), (14, 40), (15, 50), (16, 60)]

In [12]:
data

Ahmedabad     10
bangalore     20
calcutta     100
delhi         40
england       50
finland       60
dtype: int64

In [27]:
data.rank(ascending=False).sort_values()

calcutta     1.0
finland      2.0
england      3.0
delhi        4.0
bangalore    5.0
Ahmedabad    6.0
dtype: float64

In [28]:
data=pd.Series([10,20,40,40,50,60],index=['Ahmedabad','bangalore','calcutta','delhi','england','finland'])

In [29]:
data

Ahmedabad    10
bangalore    20
calcutta     40
delhi        40
england      50
finland      60
dtype: int64

In [30]:
data.rank()#method of average when values are repeated

Ahmedabad    1.0
bangalore    2.0
calcutta     3.5
delhi        3.5
england      5.0
finland      6.0
dtype: float64

In [31]:
data2=[1,2,3,4,5]
pd.DataFrame(data2,index=['a','b','c','d','e'],columns=['Bangalore'])

   Bangalore
a          1
b          2
c          3
d          4
e          5

In [33]:
abc=pd.DataFrame(np.random.randn(4,5),index=['a','b','c','d'],columns=['Q','W','E','R','T'])

In [34]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [35]:
abc.shape

(4, 5)

In [36]:
abc.dtypes

Q    float64
W    float64
E    float64
R    float64
T    float64
dtype: object

In [37]:
abc.ndim

2

In [38]:
type(abc)

pandas.core.frame.DataFrame

In [39]:
id(abc)

2213321800480

In [40]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [41]:
abc.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Q       4 non-null      float64
 1   W       4 non-null      float64
 2   E       4 non-null      float64
 3   R       4 non-null      float64
 4   T       4 non-null      float64
dtypes: float64(5)
memory usage: 192.0+ bytes

In [42]:
abc.describe()

              Q         W         E         R         T
count  4.000000  4.000000  4.000000  4.000000  4.000000
mean   0.116713 -0.253163  0.099895  0.422186 -0.630607
std    2.043709  1.458302  0.672222  0.732172  0.212077
min   -2.189385 -1.694356 -0.629166 -0.192889 -0.810141
25%   -0.797288 -1.404657 -0.173252 -0.137948 -0.745981
50%   -0.052869 -0.253236  0.015229  0.257763 -0.693228
75%    0.861131  0.898258  0.288376  0.817896 -0.577854
max    2.761974  1.188176  0.998290  1.366105 -0.325833

In [43]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [44]:
abc[['R','W']]

          R         W
a -0.192889 -1.308091
b  1.366105  0.801619
c -0.119634  1.188176
d  0.635160 -1.694356

In [45]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [46]:
abc.loc['a']

Q   -0.333255
W   -1.308091
E   -0.021281
R   -0.192889
T   -0.724595
Name: a, dtype: float64

In [47]:
abc.iloc[0]

Q   -0.333255
W   -1.308091
E   -0.021281
R   -0.192889
T   -0.724595
Name: a, dtype: float64

In [48]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [49]:
abc.loc['a':'c']

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861

In [50]:
abc.iloc[0:3]

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861

In [51]:
abc

          Q         W         E         R         T
a -0.333255 -1.308091 -0.021281 -0.192889 -0.724595
b -2.189385  0.801619  0.998290  1.366105 -0.810141
c  0.227517  1.188176  0.051738 -0.119634 -0.661861
d  2.761974 -1.694356 -0.629166  0.635160 -0.325833

In [65]:
abc.iloc[::2]

          R         W         X         Y         Z
a -0.701763 -1.933070  0.391232 -0.046157 -0.065478
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955

In [66]:
abc

          R         W         X         Y         Z
a -0.701763 -1.933070  0.391232 -0.046157 -0.065478
b  1.217872 -0.968317  0.062278 -1.459777 -0.026286
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955
d -0.553464 -1.610713 -0.803007 -0.907289  0.395533

In [67]:
abc.iloc[-1]

R   -0.553464
W   -1.610713
X   -0.803007
Y   -0.907289
Z    0.395533
Name: d, dtype: float64

In [68]:
abc.iloc[-3:]

          R         W         X         Y         Z
b  1.217872 -0.968317  0.062278 -1.459777 -0.026286
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955
d -0.553464 -1.610713 -0.803007 -0.907289  0.395533

In [69]:
abc

          R         W         X         Y         Z
a -0.701763 -1.933070  0.391232 -0.046157 -0.065478
b  1.217872 -0.968317  0.062278 -1.459777 -0.026286
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955
d -0.553464 -1.610713 -0.803007 -0.907289  0.395533

In [70]:
abc.iloc[:,0:1]

          R
a -0.701763
b  1.217872
c -2.397567
d -0.553464

In [71]:
abc

          R         W         X         Y         Z
a -0.701763 -1.933070  0.391232 -0.046157 -0.065478
b  1.217872 -0.968317  0.062278 -1.459777 -0.026286
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955
d -0.553464 -1.610713 -0.803007 -0.907289  0.395533

In [72]:
abc.iloc[0:3,1:3]

          W         X
a -1.933070  0.391232
b -0.968317  0.062278
c -0.420426 -0.678942

In [75]:
abc

          R         W         X         Y         Z
a -0.701763 -1.933070  0.391232 -0.046157 -0.065478
b  1.217872 -0.968317  0.062278 -1.459777 -0.026286
c -2.397567 -0.420426 -0.678942 -0.034838 -0.072955
d -0.553464 -1.610713 -0.803007 -0.907289  0.395533

In [76]:
abc.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [77]:
abc.values

array([[-0.70176346, -1.93307029,  0.39123156, -0.04615732, -0.06547819],
       [ 1.21787229, -0.96831737,  0.06227753, -1.45977708, -0.0262856 ],
       [-2.39756742, -0.42042573, -0.67894229, -0.03483782, -0.0729553 ],
       [-0.55346425, -1.61071304, -0.80300736, -0.90728881,  0.39553306]])

In [52]:
abc.columns

Index(['Q', 'W', 'E', 'R', 'T'], dtype='object')

In [54]:
new={'corona_positive':[12,13,45,67,np.nan],'corona_negative':[200,400,456,234,np.nan]}

In [55]:
n=pd.DataFrame(new,index=['Maha','guj','Del','Ker','Kar'])

In [56]:
n

      corona_positive  corona_negative
Maha             12.0            200.0
guj              13.0            400.0
Del              45.0            456.0
Ker              67.0            234.0
Kar               NaN              NaN

In [66]:
n.loc['Maharashtra']['corona_negative']

200.0

In [58]:
n.iloc[0,1]

200.0

How many states have corona positive cases less than 20.

In [60]:
n

      corona_positive  corona_negative
Maha             12.0            200.0
guj              13.0            400.0
Del              45.0            456.0
Ker              67.0            234.0
Kar               NaN              NaN

In [69]:
n[n['corona_positive']<20]['corona_positive'].count()

2

In [63]:
n=pd.DataFrame(new,index=['Maharashtra','Gujarat','Delhi','Karnataka','Kerala'])

In [64]:
n

             corona_positive  corona_negative
Maharashtra             12.0            200.0
Gujarat                 13.0            400.0
Delhi                   45.0            456.0
Karnataka               67.0            234.0
Kerala                   NaN              NaN

In [65]:
n.isna()

             corona_positive  corona_negative
Maharashtra            False            False
Gujarat                False            False
Delhi                  False            False
Karnataka              False            False
Kerala                  True             True

In [11]:
n.fillna('python')

     corona_positive corona_negative
Maha              12             200
guj               13             400
Del               45             456
Ker               67             234
Kar           python          python

In [12]:
n

      corona_positive  corona_negative
Maha             12.0            200.0
guj              13.0            400.0
Del              45.0            456.0
Ker              67.0            234.0
Kar               NaN              NaN

In [15]:
n.drop('corona_negative',axis=1,inplace=True)

In [16]:
n

      corona_positive
Maha             12.0
guj              13.0
Del              45.0
Ker              67.0
Kar               NaN

In [17]:
n.drop('Maha',axis=0,inplace=True)

In [18]:
n

     corona_positive
guj             13.0
Del             45.0
Ker             67.0
Kar              NaN

In [19]:
n.rank()

     corona_positive
guj              1.0
Del              2.0
Ker              3.0
Kar              NaN